---
kind: method
id: M:Autodesk.Revit.DB.FormArray.Append(Autodesk.Revit.DB.Form)
source: html/cc780649-eb3a-c883-1a87-467270faabf8.htm
---
# Autodesk.Revit.DB.FormArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	Form item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Form`)